In [2]:
import pandas as pd

In [3]:
data_18 = pd.read_csv("startup_function_2018_clean.csv")
data_19 = pd.read_csv("startup_funding2019(Clean_Data).csv")
data_20 = pd.read_csv("2020_dataset_ver4.csv")
data_21 = pd.read_csv("clean_data2021.csv")

In [15]:
data_18.isnull().sum()

Company/Brand     0
Sector           30
Stage             0
Amount($)         0
HeadQuarter       0
What_it_does      0
dtype: int64

In [4]:
data_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  525 non-null    object
 1   Sector         495 non-null    object
 2   Stage          525 non-null    object
 3   Amount($)      525 non-null    int64
 4   HeadQuarter    525 non-null    object
 5   What_it_does   525 non-null    object
dtypes: int64(1), object(5)
memory usage: 24.7+ KB

In [5]:
data_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        89 non-null     int64
 2   HeadQuarter    89 non-null     object
 3   Sector         89 non-null     object
 4   What_it_does   89 non-null     object
 5   Founders       89 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     int64
 8   Stage          89 non-null     object
dtypes: int64(2), object(7)
memory usage: 6.4+ KB

In [6]:
data_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1052 entries, 0 to 1051
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  1052 non-null   object
 1   Founded        1052 non-null   int64
 2   HeadQuarter    1052 non-null   object
 3   Sector         1052 non-null   object
 4   What_it_does   1052 non-null   object
 5   Founders       1052 non-null   object
 6   Investor       1052 non-null   object
 7   Amount($)      1052 non-null   int64
 8   Stage          1052 non-null   object
dtypes: int64(2), object(7)
memory usage: 74.1+ KB

In [7]:
data_21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1180 entries, 0 to 1179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  1180 non-null   object
 1   Founded        1180 non-null   int64
 2   HeadQuarter    1180 non-null   object
 3   Sector         1180 non-null   object
 4   What_it_does   1180 non-null   object
 5   Founders       1180 non-null   object
 6   Investor       1180 non-null   object
 7   Amount($)      1180 non-null   float64
 8   Stage          1180 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 83.1+ KB

In [8]:
data_18.head(2)

,Company/Brand,Sector,Stage,Amount($),HeadQuarter,What_it_does
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,Bangalore,"TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,5840000,Mumbai,A startup which aggregates milk from dairy far...

In [22]:
data_19.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,2015,Bangalore,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,6300000,Unknown
1,Ruangguru,2014,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,150000000,Series C

In [23]:
data_20.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount($),Stage
0,Aqgromalin,2019,Chennai,Agritech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000,Stage_unknown
1,Krayonnz,2019,Bangalore,Edtech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000,Pre-seed

In [24]:
data_21.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount($),Stage
0,Unbox Robotics,2019,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First",1200000.0,Pre-series A
1,upGrad,2015,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management",120000000.0,Unknown

In [9]:
# You can concatenate this with other DataFrames to get one data set for your work

df = pd.concat([data_18, data_19, data_20, data_21])
#df.to_csv('combined_data.csv')

In [11]:
df.to_csv('new_combined_data.csv')

In [12]:
df.head()

,Company/Brand,Sector,Stage,Amount($),HeadQuarter,What_it_does,Founded,Founders,Investor
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000.0,Bangalore,"TheCollegeFever is a hub for fun, fiesta and f...",NaN,NaN,NaN
1,Happy Cow Dairy,"Agriculture, Farming",Seed,5840000.0,Mumbai,A startup which aggregates milk from dairy far...,NaN,NaN,NaN
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,9490000.0,Gurgaon,Leading Online Loans Marketplace in India,NaN,NaN,NaN
3,PayMe India,"Financial Services, FinTech",Angel,2000000.0,Noida,PayMe India is an innovative FinTech organizat...,NaN,NaN,NaN
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,3515000.0,Hyderabad,Eunimart is a one stop solution for merchants ...,NaN,NaN,NaN

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2846 entries, 0 to 1179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  2846 non-null   object
 1   Sector         2816 non-null   object
 2   Stage          2846 non-null   object
 3   Amount($)      2846 non-null   float64
 4   HeadQuarter    2846 non-null   object
 5   What_it_does   2846 non-null   object
 6   Founded        2321 non-null   float64
 7   Founders       2321 non-null   object
 8   Investor       2321 non-null   object
dtypes: float64(2), object(7)
memory usage: 222.3+ KB